CSI API ETABS v1
cDesignConcrete.SetDesignSection Method
 Modifies the design section for all specified frame objects that have a concrete frame design procedure
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDesignSection(
	string Name,
	string PropName,
	bool LastAnalysis,
	eItemType ItemType = eItemType.Objects
)
Function SetDesignSection (
	Name As String,
	PropName As String,
	LastAnalysis As Boolean,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignConcrete
Dim Name As String
Dim PropName As String
Dim LastAnalysis As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetDesignSection(Name,
	PropName, LastAnalysis, ItemType)
int SetDesignSection(
	String^ Name,
	String^ PropName,
	bool LastAnalysis,
	eItemType ItemType = eItemType::Objects
)
abstract SetDesignSection :
        Name : string *
        PropName : string *
        LastAnalysis : bool *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item
PropName
Type: System.String
 The name of an existing frame section property to be used as the design section for the specified frame objects. This item applies only when LastAnalysis = False
LastAnalysis
Type: System.Boolean
 If this item is True, the design section for the specified frame objects is reset to the last analysis section for the frame object. If it is False, the design section is set to that specified by PropName
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the design section is successfully modified; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
ret = SapModel.File.NewGridOnly(1, 10, 10, 2, 2, 10, 10)
'create new concrete frame section properties
  ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
  ret = SapModel.PropFrame.SetRectangle("R2", "4000Psi", 20, 16)
'create a concrete column
Dim FrameName1 As String
ret = SapModel.FrameObj.AddByCoord(0, 0, 0, 0, 0, 10, FrameName1, "R1")
'run analysis
  ret = SapModel.File.Save("C:\ETABSAPI\example.edb")
  ret = SapModel.Analyze.RunAnalysis
'start concrete design
  ret = SapModel.DesignConcrete.StartDesign
'get design section
Dim PropName As String
ret = SapModel.DesignConcrete.GetDesignSection(FrameName1, PropName)
'set design section
  ret = SapModel.DesignConcrete.SetDesignSection(FrameName1, "R2", False)
ret = SapModel.DesignConcrete.GetDesignSection(FrameName1, PropName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace